app/views/products/_form.html.erb

    <%= form.label :category %>
    <%= form.collection_select :id, Category.order(:name), :id,:name, include_blank: true %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC